In [6]:
import pandas as pd
import plotly.express as px
import plotly.io as pio
pio.renderers.default = "browser"

In [7]:
df = pd.read_csv("csvsample_furniture.csv")
df.head()

,Date,Category,Product,Region,Sales_Rep,Units_Sold,Unit_Price,Total_Sales,Cost_Per_Unit,Customer_Age,Customer_Satisfaction
0,2025-01-01,Electronics,Laptop,North,Alice,5,899.99,4499.95,650.0,34,4.5
1,2025-01-01,Electronics,Phone,South,Bob,8,599.99,4799.92,420.0,28,4.2
2,2025-01-01,Clothing,Jacket,East,Carol,12,79.99,959.88,45.0,42,4.8
3,2025-01-01,Furniture,Chair,West,David,6,149.99,899.94,85.0,51,3.9
4,2025-01-02,Electronics,Tablet,North,Alice,10,399.99,3999.90,280.0,29,4.6

In [8]:
sales_by_product = df.groupby('Product')['Total_Sales'].sum().reset_index()

sales_by_product

       Product  Total_Sales
0    Bookshelf      3239.82
1        Chair      4949.67
2         Desk      6599.78
3        Dress      4599.54
4   Headphones      9118.86
5       Jacket      3759.53
6       Laptop     37799.58
7        Pants      4679.22
8        Phone     40199.33
9        Shirt      3268.91
10       Shoes      5939.34
11       Table      4799.88
12      Tablet     27199.32

In [9]:
import plotly.io as pio
import plotly.express as px
fig = px.bar(
    sales_by_product,
    x='Product',
    y='Total_Sales',
    title='Total Sales by Item',
    color='Product',
)

fig.show()

In [10]:
grouped = df.groupby(['Category', 'Region'])['Total_Sales'].sum().reset_index()

grouped

      Category Region  Total_Sales
0     Clothing   East      8038.84
1     Clothing  North      6098.92
2     Clothing  South      1349.85
3     Clothing   West      6758.93
4  Electronics  North     43799.06
5  Electronics  South     33999.08
6  Electronics   West     36518.95
7    Furniture   East     10049.57
8    Furniture  South      8639.64
9    Furniture   West       899.94

In [11]:
fig = px.bar(
    grouped,
    x='Category',
    y='Total_Sales',
    color='Region',
    barmode='group', ## 'stack' for stacked bars
    title='Total Sales by Category and Region',
    labels={'Total_Sales': 'Total Sales ($)'},
)

fig.show()

In [12]:
daily_sales = df.groupby('Date')['Total_Sales'].sum().reset_index()

daily_sales

          Date  Total_Sales
0   2025-01-01     11159.69
1   2025-01-02      8149.51
2   2025-01-03      9329.47
3   2025-01-04     14699.59
4   2025-01-05      5189.45
5   2025-01-06     14999.46
6   2025-01-07      9099.52
7   2025-01-08     11399.47
8   2025-01-09      9569.37
9   2025-01-10     10559.37
10  2025-01-11     12339.61
11  2025-01-12     17679.45
12  2025-01-13      5379.20
13  2025-01-14     16599.62

In [13]:
fig = px.line(
    daily_sales,
    x='Date',
    y='Total_Sales',
    title='Sales Trend',
    labels={'Total_Sales': 'Total Sales ($)', 'Date': 'Date'}, 
    markers=True ## add markers to the line
)

fig.show()

In [14]:
daily_sales_by_category = df.groupby(['Date', 'Category'])['Total_Sales'].sum().reset_index()

daily_sales_by_category

          Date     Category  Total_Sales
0   2025-01-01     Clothing       959.88
1   2025-01-01  Electronics      9299.87
2   2025-01-01    Furniture       899.94
3   2025-01-02     Clothing      1349.85
4   2025-01-02  Electronics      5599.70
5   2025-01-02    Furniture      1199.96
6   2025-01-03     Clothing      1829.57
7   2025-01-03  Electronics      6299.93
8   2025-01-03    Furniture      1199.97
9   2025-01-04     Clothing       999.90
10  2025-01-04  Electronics     12799.74
11  2025-01-04    Furniture       899.95
12  2025-01-05     Clothing      2079.76
13  2025-01-05  Electronics      1759.78
14  2025-01-05    Furniture      1349.91
15  2025-01-06     Clothing       899.70
16  2025-01-06  Electronics     11999.83
17  2025-01-06    Furniture      2099.93
18  2025-01-07     Clothing      2299.69
19  2025-01-07  Electronics      5199.87
20  2025-01-07    Furniture      1599.96
21  2025-01-08     Clothing      1119.86
22  2025-01-08  Electronics      9199.67
23  2025-01-08    Furniture      1079.94
24  2025-01-09     Clothing      2369.55
25  2025-01-09  Electronics      5999.90
26  2025-01-09    Furniture      1199.92
27  2025-01-10     Clothing      1139.81
28  2025-01-10  Electronics      7919.61
29  2025-01-10    Furniture      1499.95
30  2025-01-11     Clothing      2239.75
31  2025-01-11  Electronics      8099.91
32  2025-01-11    Furniture      1999.95
33  2025-01-12     Clothing      1619.82
34  2025-01-12  Electronics     14799.70
35  2025-01-12    Furniture      1259.93
36  2025-01-13     Clothing      2039.53
37  2025-01-13  Electronics      1839.77
38  2025-01-13    Furniture      1499.90
39  2025-01-14     Clothing      1299.87
40  2025-01-14  Electronics     13499.81
41  2025-01-14    Furniture      1799.94

In [15]:
fig = px.line(
    daily_sales_by_category,
    x='Date',
    y='Total_Sales',
    color='Category',  ## creates separate lines for each category
    title='Sales Over Time by Category',
    labels={'Total_Sales': 'Total Sales ($)', 'Date': 'Date'},
    markers=True
)

fig.show()

In [16]:
fig = px.scatter(
    df,
    x='Customer_Age',
    y='Customer_Satisfaction',
    title='Customer Age vs Customer Satisfaction',
    labels={'Customer_Age': 'Customer Age', 'Customer_Satisfaction': 'Customer Satisfaction Score'},
    color='Category',  ## will colour points based on category
    hover_data=['Product']  ## defines additional info on hover
)

fig.show()

In [17]:
sales_by_rep = df.groupby('Sales_Rep')['Total_Sales'].sum().reset_index()

sales_by_rep

  Sales_Rep  Total_Sales
0     Alice     49897.98
1       Bob     43988.57
2     Carol     18088.41
3     David     44177.82

In [18]:
fig = px.pie(
    sales_by_rep, ## rows in this table represent pie slices
    values='Total_Sales', ## size of each pie slice
    names='Sales_Rep', ## label for each pie slice
    title='Total Sales by Sales Representative', ## label for the chart
    hole=0,  ## replace w a bigger value (e.g., 0.4) for a donut chart
    hover_data=['Total_Sales'] ## additional info on hover
)

fig.show()